In [25]:
import pandas as pd

In [26]:
df=pd.read_csv("task.csv")

In [27]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

# question 1

In [28]:
#shape 
df.shape

(1000, 9)

In [29]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            490 non-null    object
 1   age                886 non-null    object
 2   salary             689 non-null    object
 3   department         859 non-null    object
 4   join_date          781 non-null    object
 5   city               851 non-null    object
 6   performance_score  899 non-null    object
 7   experience_years   873 non-null    object
 8   is_active          800 non-null    object
dtypes: object(9)
memory usage: 70.4+ KB

# question 2

In [37]:
missing_percent = df.isnull().sum() * 100 / len(df)
missing_percent

user_id              100.0
age                   11.4
salary                31.1
department            14.1
join_date             21.9
city                  14.9
performance_score     10.1
experience_years      12.7
is_active             20.0
dtype: float64

# question 3

In [38]:
print(df.dtypes)


df.apply(lambda col:col.map(type).nunique())

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

user_id              1
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

# question 4 ---clean user id by replacing NaN

In [33]:
df["user_id"]=df["user_id"].fillna("NaN",inplace=True)

C:\Users\krish\AppData\Local\Temp\ipykernel_17520\1228623623.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["user_id"]=df["user_id"].fillna("NaN",inplace=True)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            0 non-null      object
 1   age                886 non-null    object
 2   salary             689 non-null    object
 3   department         859 non-null    object
 4   join_date          781 non-null    object
 5   city               851 non-null    object
 6   performance_score  899 non-null    object
 7   experience_years   873 non-null    object
 8   is_active          800 non-null    object
dtypes: object(9)
memory usage: 70.4+ KB

# question 5 convert age to numeric and replace invalid values

In [43]:
df['age']=df['age'].astype('int32')

In [44]:
df['age'].fillna(df['age'].median(),inplace=True)

C:\Users\krish\AppData\Local\Temp\ipykernel_17520\2790788646.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].median(),inplace=True)

In [40]:
df['age']=df['age'].replace("unknown",0)

In [45]:
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,None,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,None,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,None,30,25000,HR,NaN,Delhi,excellent,10,False
3,None,0,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,None,25,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,None,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,None,25,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,None,0,25000,HR,invalid,Mumbai,3,5,True
998,None,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,None,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no